_posts/2017-01-26-five-months-with-rocksmith.html
---
layout: post
title: "Five Months with Rocksmith 2014"
permalink: /:title/
tags: [guitar, video games]
---
<div id="outline-container-orga92500a" class="outline-2">
<h2 id="orga92500a">Break on Through</h2>
<div class="outline-text-2" id="text-orga92500a">
<p>
I used to be pretty good with <a href="https://en.wikipedia.org/wiki/Guitar_Hero">tiny fake guitars</a>.
Not <a href="https://www.youtube.com/watch?v=O783UwqYvAo">"Through the Fire and Flames"</a> good but still <a href="https://www.youtube.com/watch?v=UpDY9oII73E">"Satch Boogie"</a> good.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
Many an evening was spent with friends and family over a copy of <i><a href="https://en.wikipedia.org/wiki/Rock_Band_(video_game)">Rock Band</a></i> or <i><a href="https://en.wikipedia.org/wiki/Guitar_Hero_World_Tour">Guitar Hero: World Tour</a></i>, but we as a civilization collectively decided after <i><a href="https://en.wikipedia.org/wiki/Lego_Rock_Band">Lego Rock Band</a></i> and <i><a href="https://en.wikipedia.org/wiki/Guitar_Hero:_Van_Halen">Guitar Hero: Van Halen</a></i> that the fake instrument rhythm games had gone too far, leaving sales dwindling and relegating our Fisher-Price instruments to the attic.
</p>

<p>
Ubisoft's <i><a href="https://en.wikipedia.org/wiki/Rocksmith_2014">Rocksmith</a></i> games are a different take on Guitar Hero-style gameplay.
Instead of simply being rock-themed entertainment, <i>Rocksmith</i> bills itself as a learning tool.
At heart, this is the familiar Skittles-colored note rectangles flying towards you, with the twist that it's played with a real guitar&#x2013;just about any will do.
I had access to an old <a href="https://en.wikipedia.org/wiki/Fender_Stratocaster">Stratocaster</a> that had been gathering dust in my parents' living room, so the price of admission was just that of the game, a small gamble to see if it really could teach me.
I played the cello from elementary school to high school before dropping it due to increasing demands on my time and lack of enjoyment.
My music theory knowledge was nonexistent and I'd never played a fretted instrument, so while the cello might have imbued me with some rhythm or manual dexterity, I picked up the guitar a clear novice.
<i>Rocksmith</i> in hand, I wanted to learn, or at least get my $30 worth of entertainment from the game.
That was five months ago.
</p>
</div>
</div>

<div id="outline-container-org507ed75" class="outline-2">
<h2 id="org507ed75">Anyone Can Play Guitar</h2>
<div class="outline-text-2" id="text-org507ed75">
<p>
<i>Rocksmith 2014</i><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> has several different modes to teach guitar.
In addition to the token score attack, there are a few dozen interactive video lessons ranging from putting on the strap to <a href="https://en.wikipedia.org/wiki/Tapping">tapping</a>, minigames to drill specific techniques (play this string to shoot the cowboy, perform a bend to climb the vine), a robust session mode where you can jam with an adaptive backing band of your choosing, and Learn a Song, the bread and butter of my <i>Rocksmith</i> routine.
Learn a Song at its most basic is simply playing the song along with the studio recording and being graded on your performance.
It's an exceedingly well thought-out system.
It breaks each song down into sections and adjusts the difficulty in real time to try to reach an appropriate level, so the bar to play along with Hendrix is basically nonexistent.
The absolute beginner might play a note only every few seconds, while the intermediate player can play a song as it was written, save for that facemelting solo.
At any moment you can hop into the Riff Repeater, a sub-mode where you can drill each section at a custom speed and difficulty with manual or automatic changes until you've got it down.
</p>

<p>
The experience of playing with studio recordings as your backing tracks is pretty incredible, because for a few minutes at a time, you're not the novice trying to strum the right string, you're the guitarist for the Pixies/Weezer/The Rolling Stones/Queens of the Stone Age, or whomever else you want (the downloadable songs list is <b>huge</b>).
I don't think the real Black Francis would be that patient with me after I butcher the arpeggio in <a href="https://www.youtube.com/watch?v=t5QqXaxLkiY">"Here Comes Your Man"</a> for the 10th time in a row, but pre-recorded Black Francis gives his all on every take!
</p>

<p>
It took a few weeks of practicing for 30-90 minutes each night, but eventually my <a href="https://www.youtube.com/watch?v=bjbgeGhn_Lg">fingers</a> were able not only to finger the right note while strumming the same string, but even hit those funky chords.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
I've settled on a routine that works for me of picking a song that's a manageable difficulty, playing it a few times at the <i>Rocksmith</i>-decided difficulty before breaking things down in the Riff Repeater at max difficulty but slow speeds.
This is an accepted best practice to learn hard songs for all instruments (maybe I do remember something from the cello days) and <i>Rocksmith</i> is amenable to it.
</p>

<p>
So does it work?
The short answer is yes.
Five months ago I didn't know how to hold a pick, and now I have learned<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> over 20 songs with it.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Artist</th>
<th scope="col" class="org-left">Song</th>
<th scope="col" class="org-right">Mastery</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Pixies</td>
<td class="org-left">Here Comes Your Man</td>
<td class="org-right">100.2%</td>
</tr>

<tr>
<td class="org-left">The Black Keys</td>
<td class="org-left">Lonely Boy</td>
<td class="org-right">100.7%</td>
</tr>

<tr>
<td class="org-left">Muse</td>
<td class="org-left">Supermassive Black Hole</td>
<td class="org-right">100.7%</td>
</tr>

<tr>
<td class="org-left">CAKE</td>
<td class="org-left">Short Skirt/Long Jacket</td>
<td class="org-right">101.0%</td>
</tr>

<tr>
<td class="org-left">Arctic Monkeys</td>
<td class="org-left">R U Mine?</td>
<td class="org-right">101.2%</td>
</tr>

<tr>
<td class="org-left">Sum 41</td>
<td class="org-left">Fat Lip</td>
<td class="org-right">101.2%</td>
</tr>

<tr>
<td class="org-left">Radiohead</td>
<td class="org-left">High and Dry</td>
<td class="org-right">102.0%</td>
</tr>

<tr>
<td class="org-left">Muse</td>
<td class="org-left">Plug in Baby</td>
<td class="org-right">102.2%</td>
</tr>

<tr>
<td class="org-left">Pixies</td>
<td class="org-left">Where is My Mind?</td>
<td class="org-right">102.7%</td>
</tr>

<tr>
<td class="org-left">Dan Auerbach</td>
<td class="org-left">I Want Some More</td>
<td class="org-right">102.9%</td>
</tr>

<tr>
<td class="org-left">Blur</td>
<td class="org-left">Song 2</td>
<td class="org-right">104.2%</td>
</tr>

<tr>
<td class="org-left">blink-182</td>
<td class="org-left">All the Small Things</td>
<td class="org-right">104.2%</td>
</tr>

<tr>
<td class="org-left">blink-182</td>
<td class="org-left">Dammit</td>
<td class="org-right">105.0%</td>
</tr>

<tr>
<td class="org-left">Franz Ferdinand</td>
<td class="org-left">Take Me Out</td>
<td class="org-right">105.5%</td>
</tr>

<tr>
<td class="org-left">Little Barrie</td>
<td class="org-left">Surf Hell</td>
<td class="org-right">106.7%</td>
</tr>

<tr>
<td class="org-left">Sigur Rós</td>
<td class="org-left">Gobbledigook</td>
<td class="org-right">106.7%</td>
</tr>

<tr>
<td class="org-left">Pixies</td>
<td class="org-left">Debaser</td>
<td class="org-right">107.2%</td>
</tr>

<tr>
<td class="org-left">The Ramones</td>
<td class="org-left">Blitzkrieg Bop</td>
<td class="org-right">107.4%</td>
</tr>

<tr>
<td class="org-left">The Rolling Stones</td>
<td class="org-left">(I Can't Get No) Satisfaction</td>
<td class="org-right">108.7%</td>
</tr>

<tr>
<td class="org-left">Jarvis Cocker</td>
<td class="org-left">Angela</td>
<td class="org-right">109.7%</td>
</tr>

<tr>
<td class="org-left">The Black Keys</td>
<td class="org-left">Next Girl</td>
<td class="org-right">110.0%</td>
</tr>
</tbody>
</table>

<p>
But these aren't just any songs.
Some of these are from my favorite bands ("Debaser", "High and Dry"), some are recognizable tunes useful to have in my back pocket ("All the Small Things", "Short Skirt/Long Jacket"), and some are just a ton of fun to play ("Fat Lip").<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>
Moreso than other rhythm games <i>Rocksmith</i> benefits from a strong catalog of downloadable songs, since I care more about what I'm playing when I'm actually playing the song on a guitar instead of the song to which I'm pressing five buttons on a ukelele-sized Les Paul.
To that end, the original <i>Rocksmith</i> (not <i>Rocksmith 2014</i>) is a must-buy for anyone looking to use the games as a beginner.
It contains way more novice-friendly tracks than the 2014 version and its tracks can be imported into the improved <i>Rocksmith 2014</i> engine for a modest fee.
This is the best value for adding content, but I've also bought some individual songs and packs.
I am strongly opposed to microtransactions, but it's an easier proposition to spend money in the <i>Rocksmith</i> store when it's peddling tools to learn songs you can then play outside the game.
</p>
</div>
</div>

<div id="outline-container-orgd1e1b25" class="outline-2">
<h2 id="orgd1e1b25">You Really Got Me</h2>
<div class="outline-text-2" id="text-orgd1e1b25">
<p>
After five months of work, I'm thrilled with my results and proud to look at the above table.
There are songs on there that I first learned in <i>Guitar Hero</i> that I then learned on the actual guitar with <i>Rocksmith</i>, and there's something beautiful about coming full circle like that.
I'm seeing frequent improvements in my skill and it's very rewarding to see immediate dividends as my mastery increases on each song.
That arpeggio I mentioned in "Here Comes Your Man"?
Turns out <a href="https://en.wikipedia.org/wiki/We%2527re_All_to_Blame">"We're All to Blame"</a> has a darn similar section, and suddenly I can play that too!
I'm at a fun point in my development as a guitarist and am eager to continue.
</p>

<p>
It's a fair question to ask what the role of <i>Rocksmith</i> has been in all of this.
What's the counterfactual, where would I be now without <i>Rocksmith</i>?
There's no shortage of books, websites, and teachers available to learn guitar.
While I could definitely stand to supplement <i>Rocksmith</i> with private lessons or at least some video lectures, <i>Rocksmith</i> has aided my development in two ways.
First and most obviously is the tools, games, and modes it features, and these are legitimate value added over a book of tabs.
But secondly and most importantly is that <i>Rocksmith</i> is a way to get me to plug in my guitar every night and play.
Ultimately, this is the single most important and effective step to learn.
Frankly, without <i>Rocksmith</i>, I'm not sure I'd be playing at all right now.
Learning an instrument is hard, but <i>Rocksmith</i> does its part to make that initial hill easier, which is invaluable.
I don't know what I'll be able to play after another 5 months, but I'm sure <i>Rocksmith</i> will have a song or seven I'll want to learn that will be right for me then.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
With liberal use of Star Power to gloss over my inability to play the actually hard parts. Still counts.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<i>Rocksmith</i> is actually the title of the first game in the series, but <i>Rocksmith 2014</i> is its replacement rather than sequel or expansion. I'll use the titles interchangeably, especially since the latter title is also now known as <i>Rocksmith 2014 Edition Remastered</i> after a big quality of life update.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
I was not a happy camper the first time I saw a <a href="https://en.wikipedia.org/wiki/Barre_chord">barre chord</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<i>Rocksmith</i> records your "mastery" of each song. It's based on your accuracy, but <i>Rocksmith</i> will start to fade out sections of a song as you learn it to force you to memorize it, and it awards bonus mastery percentage points for this, up to a maximum score of 110% for a flawless performance on a song where the entire track is in mastery mode. 100% is where <i>Rocksmith</i> officially declares that you have learned a song.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
The 2001 version of me thinks I'm the coolest guy in the world for being able to play that one. 2016 me may also have been excited to find out that it was available in <i>Rocksmith</i> to fulfill my youth pop punk fantasies.
</p></div></div>


</div>
</div>
